;;;
;;; Copyright (c) 2010-2013 uim Project https://github.com/uim/uim
;;;
;;; All rights reserved.
;;;
;;; Redistribution and use in source and binary forms, with or without
;;; modification, are permitted provided that the following conditions
;;; are met:
;;; 1. Redistributions of source code must retain the above copyright
;;;    notice, this list of conditions and the following disclaimer.
;;; 2. Redistributions in binary form must reproduce the above copyright
;;;    notice, this list of conditions and the following disclaimer in the
;;;    documentation and/or other materials provided with the distribution.
;;; 3. Neither the name of authors nor the names of its contributors
;;;    may be used to endorse or promote products derived from this software
;;;    without specific prior written permission.
;;;
;;; THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS ``AS IS'' AND
;;; ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
;;; IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
;;; ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDERS OR CONTRIBUTORS BE LIABLE
;;; FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
;;; DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
;;; OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
;;; HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
;;; LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
;;; OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
;;; SUCH DAMAGE.
;;;;

(require "util.scm")

(define ja-rk-rule-basic
  '(
    ((("-"). ())("ー" "ー" "ー"))
    (((","). ())("、" "、" "、"))
    ((("."). ())("。" "。" "。"))
    ((("!"). ())("！" "！" "!"))
    ((("\""). ())("”" "”" "\""))
    ((("#"). ())("＃" "＃" "#"))
    ((("$"). ())("＄" "＄" "$"))
    ((("%"). ())("％" "％" "%"))
    ((("&"). ())("＆" "＆" "&"))
    ((("'"). ())("’" "’" "'"))
    ((("("). ())("（" "（" "("))
    (((")"). ())("）" "）" ")"))
    ((("~"). ())("〜" "〜" "~"))
    ((("="). ())("＝" "＝" "="))
    ((("^"). ())("＾" "＾" "^"))
    ((("\\"). ())("＼" "＼" "\\"))
    ((("|"). ())("｜" "｜" "|"))
    ((("`"). ())("‘" "‘" "`"))
    ((("@"). ())("＠" "＠" "@"))
    ((("{"). ())("｛" "｛" "{"))
    ((("["). ())("「" "「" "「"))
    ((("+"). ())("＋" "＋" "+"))
    (((";"). ())("；" "；" ";"))
    ((("*"). ())("＊" "＊" "*"))
    (((":"). ())("：" "：" ":"))
    ((("}"). ())("｝" "｝" "}"))
    ((("]"). ())("」" "」" "」"))
    ((("<"). ())("＜" "＜" "<"))
    (((">"). ())("＞" "＞" ">"))
    ((("?"). ())("？" "？" "?"))
    ((("/"). ())("／" "／" "/"))
    ((("_"). ())("＿" "＿" "_"))
    ;; Since ordinary Japanese users press the "yen sign" key on
    ;; Japanese keyboard in romaji-halfwidth-kana-mode "to input
    ;; character code 134" rather than "to input yen sign symbol", I
    ;; changed the fullwidth yen sign with backslash.
    ;;   -- YamaKen 2007-09-17
    ;; ((("yen"). ())("¥" "¥" "¥")) ;; XXX
    ((("yen"). ())("¥" "¥" "\\"))

    ((("1"). ())("1" "1" "1"))
    ((("2"). ())("2" "2" "2"))
    ((("3"). ())("3" "3" "3"))
    ((("4"). ())("4" "4" "4"))
    ((("5"). ())("5" "5" "5"))
    ((("6"). ())("6" "6" "6"))
    ((("7"). ())("7" "7" "7"))
    ((("8"). ())("8" "8" "8"))
    ((("9"). ())("9" "9" "9"))
    ((("0"). ())("0" "0" "0"))

    ((("a"). ())("あ" "ア" "ア"))
    ((("i"). ())("い" "イ" "イ"))
    ((("u"). ())("う" "ウ" "ウ"))
    ((("e"). ())("え" "エ" "エ"))
    ((("o"). ())("お" "オ" "オ"))

    ((("x" "a"). ())("ぁ" "ァ" "ァ"))
    ((("x" "i"). ())("ぃ" "ィ" "ィ"))
    ((("x" "y" "i"). ())("ぃ" "ィ" "ィ"))
    ((("x" "u"). ())("ぅ" "ゥ" "ゥ"))
    ((("x" "e"). ())("ぇ" "ェ" "ェ"))
    ((("x" "y" "e"). ())("ぇ" "ェ" "ェ"))
    ((("x" "o"). ())("ぉ" "ォ" "ォ"))

    ((("l" "a"). ())("ぁ" "ァ" "ァ"))
    ((("l" "i"). ())("ぃ" "ィ" "ィ"))
    ((("l" "u"). ())("ぅ" "ゥ" "ゥ"))
    ((("l" "e"). ())("ぇ" "ェ" "ェ"))
    ((("l" "o"). ())("ぉ" "ォ" "ォ"))

    ((("k" "k"). ("k"))("っ" "ッ" "ッ"))

    ((("k" "a"). ())("か" "カ" "カ"))
    ((("k" "i"). ())("き" "キ" "キ"))
    ((("k" "u"). ())("く" "ク" "ク"))
    ((("k" "e"). ())("け" "ケ" "ケ"))
    ((("k" "o"). ())("こ" "コ" "コ"))
    ((("k" "y" "a"). ())(("き" "キ" "キ") ("ゃ" "ャ" "ャ")))
    ((("k" "y" "i"). ())(("き" "キ" "キ") ("ぃ" "ィ" "ィ")))
    ((("k" "y" "u"). ())(("き" "キ" "キ") ("ゅ" "ュ" "ュ")))
    ((("k" "y" "e"). ())(("き" "キ" "キ") ("ぇ" "ェ" "ェ")))
    ((("k" "y" "o"). ())(("き" "キ" "キ") ("ょ" "ョ" "ョ")))

    ((("g" "g"). ("g"))("っ" "ッ" "ッ"))


    ((("g" "a"). ())("が" "ガ" "ガ"))
    ((("g" "i"). ())("ぎ" "ギ" "ギ"))
    ((("g" "u"). ())("ぐ" "グ" "グ"))
    ((("g" "e"). ())("げ" "ゲ" "ゲ"))
    ((("g" "o"). ())("ご" "ゴ" "ゴ"))

    ((("g" "y" "a"). ())(("ぎ" "ギ" "ギ") ("ゃ" "ャ" "ャ")))
    ((("g" "y" "i"). ())(("ぎ" "ギ" "ギ") ("ぃ" "ィ" "ィ")))
    ((("g" "y" "u"). ())(("ぎ" "ギ" "ギ") ("ゅ" "ュ" "ュ")))
    ((("g" "y" "e"). ())(("ぎ" "ギ" "ギ") ("ぇ" "ェ" "ェ")))
    ((("g" "y" "o"). ())(("ぎ" "ギ" "ギ") ("ょ" "ョ" "ョ")))

    ((("q" "a"). ())(("く" "ク" "ク") ("ぁ" "ァ" "ァ")))
    ((("q" "i"). ())(("く" "ク" "ク") ("ぃ" "ィ" "ィ")))
    ((("q" "u"). ())("く" "ク" "ク"))
    ((("q" "e"). ())(("く" "ク" "ク") ("ぇ" "ェ" "ェ")))
    ((("q" "o"). ())(("く" "ク" "ク") ("ぉ" "ォ" "ォ")))

    ((("s" "s"). ("s"))("っ" "ッ" "ッ"))

    ((("s" "a"). ())("さ" "サ" "サ"))
    ((("s" "i"). ())("し" "シ" "シ"))
    ((("s" "u"). ())("す" "ス" "ス"))
    ((("s" "e"). ())("せ" "セ" "セ"))
    ((("s" "o"). ())("そ" "ソ" "ソ"))

    ((("s" "y" "a"). ())(("し" "シ" "シ") ("ゃ" "ャ" "ャ")))
    ((("s" "y" "i"). ())(("し" "シ" "シ") ("ぃ" "ィ" "ィ")))
    ((("s" "y" "u"). ())(("し" "シ" "シ") ("ゅ" "ュ" "ュ")))
    ((("s" "y" "e"). ())(("し" "シ" "シ") ("ぇ" "ェ" "ェ")))
    ((("s" "y" "o"). ())(("し" "シ" "シ") ("ょ" "ョ" "ョ")))

    ((("z" "z"). ("z"))("っ" "ッ" "ッ"))

    ((("z" "a"). ())("ざ" "ザ" "ザ"))
    ((("z" "i"). ())("じ" "ジ" "ジ"))
    ((("z" "u"). ())("ず" "ズ" "ズ"))
    ((("z" "e"). ())("ぜ" "ゼ" "ゼ"))
    ((("z" "o"). ())("ぞ" "ゾ" "ゾ"))
    ((("z" "y" "a"). ())(("じ" "ジ" "ジ") ("ゃ" "ャ" "ャ")))
    ((("z" "y" "i"). ())(("じ" "ジ" "ジ") ("ぃ" "ィ" "ィ")))
    ((("z" "y" "u"). ())(("じ" "ジ" "ジ") ("ゅ" "ュ" "ュ")))
    ((("z" "y" "e"). ())(("じ" "ジ" "ジ") ("ぇ" "ェ" "ェ")))
    ((("z" "y" "o"). ())(("じ" "ジ" "ジ") ("ょ" "ョ" "ョ")))

    ((("j" "j"). ("j"))("っ" "ッ" "ッ"))

    ((("j" "a"). ())(("じ" "ジ" "ジ") ("ゃ" "ャ" "ャ")))
    ((("j" "i"). ())("じ" "ジ" "ジ"))
    ((("j" "u"). ())(("じ" "ジ" "ジ") ("ゅ" "ュ" "ュ")))
    ((("j" "e"). ())(("じ" "ジ" "ジ") ("ぇ" "ェ" "ェ")))
    ((("j" "o"). ())(("じ" "ジ" "ジ") ("ょ" "ョ" "ョ")))

    ((("j" "y" "a"). ())(("じ" "ジ" "ジ") ("ゃ" "ャ" "ャ")))
    ((("j" "y" "i"). ())(("じ" "ジ" "ジ") ("ぃ" "ィ" "ィ")))
    ((("j" "y" "u"). ())(("じ" "ジ" "ジ") ("ゅ" "ュ" "ュ")))
    ((("j" "y" "e"). ())(("じ" "ジ" "ジ") ("ぇ" "ェ" "ェ")))
    ((("j" "y" "o"). ())(("じ" "ジ" "ジ") ("ょ" "ョ" "ョ")))

    ((("t" "t"). ("t"))("っ" "ッ" "ッ"))
    ((("t" "c"). ("c"))("っ" "ッ" "ッ"))

    ((("t" "a"). ())("た" "タ" "タ"))
    ((("t" "i"). ())("ち" "チ" "チ"))
    ((("t" "u"). ())("つ" "ツ" "ツ"))
    ((("t" "e"). ())("て" "テ" "テ"))
    ((("t" "o"). ())("と" "ト" "ト"))

    ((("t" "y" "a"). ())(("ち" "チ" "チ") ("ゃ" "ャ" "ャ")))
    ((("t" "y" "i"). ())(("ち" "チ" "チ") ("ぃ" "ィ" "ィ")))
    ((("t" "y" "u"). ())(("ち" "チ" "チ") ("ゅ" "ュ" "ュ")))
    ((("t" "y" "e"). ())(("ち" "チ" "チ") ("ぇ" "ェ" "ェ")))
    ((("t" "y" "o"). ())(("ち" "チ" "チ") ("ょ" "ョ" "ョ")))

    ((("t" "s" "a"). ())(("つ" "ツ" "ツ") ("ぁ" "ァ" "ァ")))
    ((("t" "s" "i"). ())(("つ" "ツ" "ツ") ("ぃ" "ィ" "ィ")))
    ((("t" "s" "u"). ())("つ" "ツ" "ツ"))
    ((("t" "s" "e"). ())(("つ" "ツ" "ツ") ("ぇ" "ェ" "ェ")))
    ((("t" "s" "o"). ())(("つ" "ツ" "ツ") ("ぉ" "ォ" "ォ")))

    ((("c" "y" "a"). ())(("ち" "チ" "チ") ("ゃ" "ャ" "ャ")))
    ((("c" "y" "i"). ())(("ち" "チ" "チ") ("ぃ" "ィ" "ィ")))
    ((("c" "y" "u"). ())(("ち" "チ" "チ") ("ゅ" "ュ" "ュ")))
    ((("c" "y" "e"). ())(("ち" "チ" "チ") ("ぇ" "ェ" "ェ")))
    ((("c" "y" "o"). ())(("ち" "チ" "チ") ("ょ" "ョ" "ョ")))

    ((("x" "t" "u"). ())("っ" "ッ" "ッ"))
    ((("x" "t" "s" "u"). ())("っ" "ッ" "ッ"))
    ((("c" "c"). ("c"))("っ" "ッ" "ッ"))

    ((("d" "d"). ("d"))("っ" "ッ" "ッ"))

    ((("d" "a"). ())("だ" "ダ" "ダ"))
    ((("d" "i"). ())("ぢ" "ヂ" "ヂ"))
    ((("d" "u"). ())("づ" "ヅ" "ヅ"))
    ((("d" "e"). ())("で" "デ" "デ"))
    ((("d" "o"). ())("ど" "ド" "ド"))

    ((("d" "y" "a"). ())(("ぢ" "ヂ" "ヂ") ("ゃ" "ャ" "ャ")))
    ((("d" "y" "i"). ())(("ぢ" "ヂ" "ヂ") ("ぃ" "ィ" "ィ")))
    ((("d" "y" "u"). ())(("ぢ" "ヂ" "ヂ") ("ゅ" "ュ" "ュ")))
    ((("d" "y" "e"). ())(("ぢ" "ヂ" "ヂ") ("ぇ" "ェ" "ェ")))
    ((("d" "y" "o"). ())(("ぢ" "ヂ" "ヂ") ("ょ" "ョ" "ョ")))

    ((("n" "n"). ())("ん" "ン" "ン"))
    ((("n" "'"). ())("ん" "ン" "ン"))
    ((("n"). ())("ん" "ン" "ン"))

    ((("n" "a"). ())("な" "ナ" "ナ"))
    ((("n" "i"). ())("に" "ニ" "ニ"))
    ((("n" "u"). ())("ぬ" "ヌ" "ヌ"))
    ((("n" "e"). ())("ね" "ネ" "ネ"))
    ((("n" "o"). ())("の" "ノ" "ノ"))

    ((("n" "y" "a"). ())(("に" "ニ" "ニ") ("ゃ" "ャ" "ャ")))
    ((("n" "y" "i"). ())(("に" "ニ" "ニ") ("ぃ" "ィ" "ィ")))
    ((("n" "y" "u"). ())(("に" "ニ" "ニ") ("ゅ" "ュ" "ュ")))
    ((("n" "y" "e"). ())(("に" "ニ" "ニ") ("ぇ" "ェ" "ェ")))
    ((("n" "y" "o"). ())(("に" "ニ" "ニ") ("ょ" "ョ" "ョ")))

    ((("h" "h"). ("h"))("っ" "ッ" "ッ"))

    ((("h" "a"). ())("は" "ハ" "ハ"))
    ((("h" "i"). ())("ひ" "ヒ" "ヒ"))
    ((("h" "u"). ())("ふ" "フ" "フ"))
    ((("h" "e"). ())("へ" "ヘ" "ヘ"))
    ((("h" "o"). ())("ほ" "ホ" "ホ"))

    ((("h" "y" "a"). ())(("ひ" "ヒ" "ヒ") ("ゃ" "ャ" "ャ")))
    ((("h" "y" "i"). ())(("ひ" "ヒ" "ヒ") ("ぃ" "ィ" "ィ")))
    ((("h" "y" "u"). ())(("ひ" "ヒ" "ヒ") ("ゅ" "ュ" "ュ")))
    ((("h" "y" "e"). ())(("ひ" "ヒ" "ヒ") ("ぇ" "ェ" "ェ")))
    ((("h" "y" "o"). ())(("ひ" "ヒ" "ヒ") ("ょ" "ョ" "ョ")))

    ((("f" "f"). ("f"))("っ" "ッ" "ッ"))

    ((("f" "a"). ())(("ふ" "フ" "フ") ("ぁ" "ァ" "ァ")))
    ((("f" "i"). ())(("ふ" "フ" "フ") ("ぃ" "ィ" "ィ")))
    ((("f" "u"). ())("ふ" "フ" "フ"))
    ((("f" "e"). ())(("ふ" "フ" "フ") ("ぇ" "ェ" "ェ")))
    ((("f" "o"). ())(("ふ" "フ" "フ") ("ぉ" "ォ" "ォ")))

    ((("f" "y" "a"). ())(("ふ" "フ" "フ") ("ゃ" "ャ" "ャ")))
    ((("f" "y" "i"). ())(("ふ" "フ" "フ") ("ぃ" "ィ" "ィ")))
    ((("f" "y" "u"). ())(("ふ" "フ" "フ") ("ゅ" "ュ" "ュ")))
    ((("f" "y" "e"). ())(("ふ" "フ" "フ") ("ぇ" "ェ" "ェ")))
    ((("f" "y" "o"). ())(("ふ" "フ" "フ") ("ょ" "ョ" "ョ")))

    ((("b" "b"). ("b"))("っ" "ッ" "ッ"))

    ((("b" "a"). ())("ば" "バ" "バ"))
    ((("b" "i"). ())("び" "ビ" "ビ"))
    ((("b" "u"). ())("ぶ" "ブ" "ブ"))
    ((("b" "e"). ())("べ" "ベ" "ベ"))
    ((("b" "o"). ())("ぼ" "ボ" "ボ"))

    ((("b" "y" "a"). ())(("び" "ビ" "ビ") ("ゃ" "ャ" "ャ")))
    ((("b" "y" "i"). ())(("び" "ビ" "ビ") ("ぃ" "ィ" "ィ")))
    ((("b" "y" "u"). ())(("び" "ビ" "ビ") ("ゅ" "ュ" "ュ")))
    ((("b" "y" "e"). ())(("び" "ビ" "ビ") ("ぇ" "ェ" "ェ")))
    ((("b" "y" "o"). ())(("び" "ビ" "ビ") ("ょ" "ョ" "ョ")))

    ((("p" "p"). ("p"))("っ" "ッ" "ッ"))

    ((("p" "a"). ())("ぱ" "パ" "パ"))
    ((("p" "i"). ())("ぴ" "ピ" "ピ"))
    ((("p" "u"). ())("ぷ" "プ" "プ"))
    ((("p" "e"). ())("ぺ" "ペ" "ペ"))
    ((("p" "o"). ())("ぽ" "ポ" "ポ"))

    ((("p" "y" "a"). ())(("ぴ" "ピ" "ピ") ("ゃ" "ャ" "ャ")))
    ((("p" "y" "i"). ())(("ぴ" "ピ" "ピ") ("ぃ" "ィ" "ィ")))
    ((("p" "y" "u"). ())(("ぴ" "ピ" "ピ") ("ゅ" "ュ" "ュ")))
    ((("p" "y" "e"). ())(("ぴ" "ピ" "ピ") ("ぇ" "ェ" "ェ")))
    ((("p" "y" "o"). ())(("ぴ" "ピ" "ピ") ("ょ" "ョ" "ョ")))

    ((("m" "m"). ("m"))("っ" "ッ" "ッ"))

    ((("m" "b"). ("b"))("ん" "ン" "ン"))
    ((("m" "p"). ("p"))("ん" "ン" "ン"))

    ((("m" "a"). ())("ま" "マ" "マ"))
    ((("m" "i"). ())("み" "ミ" "ミ"))
    ((("m" "u"). ())("む" "ム" "ム"))
    ((("m" "e"). ())("め" "メ" "メ"))
    ((("m" "o"). ())("も" "モ" "モ"))

    ((("m" "y" "a"). ())(("み" "ミ" "ミ") ("ゃ" "ャ" "ャ")))
    ((("m" "y" "i"). ())(("み" "ミ" "ミ") ("ぃ" "ィ" "ィ")))
    ((("m" "y" "u"). ())(("み" "ミ" "ミ") ("ゅ" "ュ" "ュ")))
    ((("m" "y" "e"). ())(("み" "ミ" "ミ") ("ぇ" "ェ" "ェ")))
    ((("m" "y" "o"). ())(("み" "ミ" "ミ") ("ょ" "ョ" "ョ")))

    ((("y" "y"). ("y"))("っ" "ッ" "ッ"))

    ((("y" "a"). ())("や" "ヤ" "ヤ"))
    ((("y" "u"). ())("ゆ" "ユ" "ユ"))
    ((("y" "e"). ())(("い" "イ" "イ") ("ぇ" "ェ" "ェ")))
    ((("y" "o"). ())("よ" "ヨ" "ヨ"))

    ((("x" "c" "a"). ())("ヵ" "ヵ" "カ"))
    ((("x" "k" "a"). ())("ヵ" "ヵ" "カ"))
    ((("x" "k" "e"). ())("ヶ" "ヶ" "ケ"))

    ((("x" "y" "a"). ())("ゃ" "ャ" "ャ"))
    ((("x" "y" "u"). ())("ゅ" "ュ" "ュ"))
    ((("x" "y" "o"). ())("ょ" "ョ" "ョ"))

    ((("r" "r"). ("r"))("っ" "ッ" "ッ"))

    ((("r" "a"). ())("ら" "ラ" "ラ"))
    ((("r" "i"). ())("り" "リ" "リ"))
    ((("r" "u"). ())("る" "ル" "ル"))
    ((("r" "e"). ())("れ" "レ" "レ"))
    ((("r" "o"). ())("ろ" "ロ" "ロ"))

    ((("l" "t" "u"). ())("っ" "ッ" "ッ"))
    ((("l" "t" "s" "u"). ())("っ" "ッ" "ッ"))

    ((("l" "y" "a"). ())("ゃ" "ャ" "ャ"))
    ((("l" "y" "i"). ())("ぃ" "ィ" "ィ"))
    ((("l" "y" "u"). ())("ゅ" "ュ" "ュ"))
    ((("l" "y" "e"). ())("ぇ" "ェ" "ェ"))
    ((("l" "y" "o"). ())("ょ" "ョ" "ョ"))

    ((("r" "y" "a"). ())(("り" "リ" "リ") ("ゃ" "ャ" "ャ")))
    ((("r" "y" "i"). ())(("り" "リ" "リ") ("ぃ" "ィ" "ィ")))
    ((("r" "y" "u"). ())(("り" "リ" "リ") ("ゅ" "ュ" "ュ")))
    ((("r" "y" "e"). ())(("り" "リ" "リ") ("ぇ" "ェ" "ェ")))
    ((("r" "y" "o"). ())(("り" "リ" "リ") ("ょ" "ョ" "ョ")))

    ((("w" "w"). ("w"))("っ" "ッ" "ッ"))

    ((("w" "a"). ())("わ" "ワ" "ワ"))
    ((("w" "i"). ())(("う" "ウ" "ウ") ("ぃ" "ィ" "ィ")))
    ((("w" "u"). ())("う" "ウ" "ウ"))
    ((("w" "e"). ())(("う" "ウ" "ウ") ("ぇ" "ェ" "ェ")))
    ((("w" "o"). ())("を" "ヲ" "ヲ"))
    ((("w" "h" "a"). ())(("う" "ウ" "ウ") ("ぁ" "ァ" "ァ")))
    ((("w" "h" "i"). ())(("う" "ウ" "ウ") ("ぃ" "ィ" "ィ")))
    ((("w" "h" "u"). ())("う" "ウ" "ウ"))
    ((("w" "h" "e"). ())(("う" "ウ" "ウ") ("ぇ" "ェ" "ェ")))
    ((("w" "h" "o"). ())(("う" "ウ" "ウ") ("ぉ" "ォ" "ォ")))

    ((("v" "v"). ("v"))("っ" "ッ" "ッ"))

    ((("v" "a"). ())(("う゛" "ヴ" "ヴ") ("ぁ" "ァ" "ァ")))
    ((("v" "i"). ())(("う゛" "ヴ" "ヴ") ("ぃ" "ィ" "ィ")))
    ((("v" "u"). ())("う゛" "ヴ" "ヴ"))
    ((("v" "e"). ())(("う゛" "ヴ" "ヴ") ("ぇ" "ェ" "ェ")))
    ((("v" "o"). ())(("う゛" "ヴ" "ヴ") ("ぉ" "ォ" "ォ")))

    ((("v" "y" "a"). ())(("う゛" "ヴ" "ヴ") ("ゃ" "ャ" "ャ")))
    ((("v" "y" "u"). ())(("う゛" "ヴ" "ヴ") ("ゅ" "ュ" "ュ")))
    ((("v" "y" "o"). ())(("う゛" "ヴ" "ヴ") ("ょ" "ョ" "ョ")))

    ((("z" "k"). ())("↑" "↑" ""))
    ((("z" "j"). ())("↓" "↓" ""))
    ((("z" "h"). ())("←" "←" ""))
    ((("z" "l"). ())("→" "→" ""))
    ((("z" "-"). ())("〜" "〜" ""))
    ((("z" "["). ())("『" "『" ""))
    ((("z" "]"). ())("』" "』" ""))
    ((("z" ","). ())("‥" "‥" ""))
    ((("z" "."). ())("…" "…" ""))
    ((("z" "/"). ())("・" "・" "・"))
    ))

(define ja-rk-rule-basic-uim ja-rk-rule-basic)

(define ja-rk-rule-rule->table (lambda (rule)
  (map
    (lambda (item)
      ; ((("k" "a")) ("か" "カ" "カ")) -> ("ka" "" "か")
      ; ((("k" "k") "k") ("っ" "ッ" "ッ")) -> ("kk" "k" "っ")
      ; ((("k" "y" "a")) (("き" "キ" "キ") ("ゃ" "ャ" "ャ"))) -> ("kya" "" "きゃ")
      (list
        ; ((("k" "a")) ("か" "カ" "カ")) -> "ka"
        (fold-right string-append ""
          (caar item))
        (let ((next-input (cdar item)))
          (or
            (and
              ; ((("k" "a")) ("か" "カ" "カ")) -> ""
              (null? next-input) "")
            ; ((("k" "k") "k") ("っ" "ッ" "ッ")) -> "k"
            (car next-input)))
        (let*
          ((output (cadr item))
            (single-output (car output))
            (eucjp->utf8 (lambda (str)
                           (iconv-convert "UTF-8" "EUC-JP" str))))
          (or
            (and
              ; ((("k" "a")) ("か" "カ" "カ")) -> "か"
              (string? single-output)
              (eucjp->utf8 single-output))
            ; ((("k" "y" "a")) (("き" "キ" "キ") ("ゃ" "ャ" "ャ"))) -> "きゃ"
            (eucjp->utf8
              (string-join
                (map first output) "")))))) rule)))

(define ja-rk-rule-table->rule (lambda (table)
  (map
    (lambda (item)
      ; ("ka" "" "か") -> ((("k" "a")) ("か" "カ" "カ"))
      ; ("kk" "k" "っ") -> ((("k" "k") "k") ("っ" "ッ" "ッ"))
      ; ("kya" "" "きゃ") -> ((("k" "y" "a")) (("き" "キ" "キ") ("ゃ" "ャ" "ャ")))
      (list
        (cons
          (let ((input (car item)))
            (or
              (and
                (string=? input "yen")
                ; ("yen" "" "¥") -> ("yen")
                '("yen"))
              ; ("ka" "" "か") -> ("k" "a")
              (map string
                (string->list input))))
          (let ((next-input (cadr item)))
            (or
              (and
                ; ("ka" "" "か") -> none
                (string=? next-input "") '())
              ; ("kk" "k" "っ") -> "k"
              (cons next-input '()))))
        (let* ((output (caddr item))
               (utf8->eucjp (lambda (str)
                              (iconv-convert "EUC-JP" "UTF-8" str)))
               (eucjp-output (utf8->eucjp output))
               (eucjp-output-list (string-to-list eucjp-output)))
          (or
            (and
              (=
                (length eucjp-output-list) 1)
              ; ("ka" "" "か") ->  ("か" "カ" "カ")
              (ja-find-kana-list-from-rule ja-rk-rule eucjp-output))
            ; ("kya" "" "きゃ") -> (("き" "キ" "キ") ("ゃ" "ャ" "ャ"))
            (map
              (lambda (char)
                (ja-find-kana-list-from-rule ja-rk-rule char))
                  (reverse eucjp-output-list)))))) table)))

(define-custom-group 'ja-rk-rule
                     (N_ "Japanese Romaji-Kana")
                     (N_ "long description will be here."))

(define-custom-group 'composing-rule
                     (N_ "Composing rule")
                     (N_ "long description will be here."))

(define-custom 'ja-rk-rule-type 'uim
               '(ja-rk-rule composing-rule)
               (list 'choice
	         (list 'uim (N_ "uim") (N_ "uim native"))
	         (list 'custom (N_ "Custom") (N_ "Custom")))
               (N_ "Composing rule type")
               (N_ "long description will be here."))

(define-custom 'ja-rk-rule-table-basic
               (ja-rk-rule-rule->table ja-rk-rule-basic-uim)
               '(ja-rk-rule composing-rule)
               (list 'table
                 (list 'input (N_ "Input") (N_ "Input"))
		 (list 'next-input (N_ "Next input") (N_ "Next input"))
                 (list 'output (N_ "Output") (N_ "Output")))
               (N_ "Custom composing rule")
               (N_ "long description will be here."))

(define-custom 'ja-rk-rule-keep-consonant? #f
               '(ja-rk-rule composing-rule)
               '(boolean)
               (N_ "Keep consonant Romaji not convertible to Kana")
               (N_ "long description will be here."))

(custom-add-hook 'ja-rk-rule-table-basic
                 'custom-set-hooks
                 (lambda ()
                   (and
                     (eq? ja-rk-rule-type 'uim)
                       (set! ja-rk-rule-basic ja-rk-rule-basic-uim))
                   (ja-rk-rule-update)))

(custom-add-hook 'ja-rk-rule-table-basic
                 'custom-activity-hooks
                 (lambda ()
                   (eq? ja-rk-rule-type 'custom)))

(custom-add-hook 'ja-rk-rule-keep-consonant?
                 'custom-set-hooks
                 (lambda ()
                   (ja-rk-rule-keep-consonant-update)))
